"""Классы пакета core реализуют внутреннюю логику и составляют ядро системы
    онлайн-калькулятора.

    Пакет содержит класс DatElement для описания структуры входных/выходных
    данных, класс Algorithm, описывающий алгоритм и предоставляющий возможность
    для его выполнения, класс AlgorithmBuilder, конструирующий алгоритмы из
    исходного кода, написанного студентами, класс AlgorithmCollection,
    представляющий набор алгоритмов и реализующий функциональность для
    выполнения запросов к API онлайн-калькулятора.

"""
